<a href="https://colab.research.google.com/github/Saranchana/DW/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Read Data Frame object

In [0]:
import pandas as pd

In [10]:
df =pd.read_csv ('https://raw.githubusercontent.com/Saranchana/DW/master/titanic_tab.txt', delimiter="\t")
df

     Passenger Class  ... Survived
0              First  ...      Yes
1              First  ...      Yes
2              First  ...       No
3              First  ...       No
4              First  ...       No
...              ...  ...      ...
1304           Third  ...       No
1305           Third  ...       No
1306           Third  ...       No
1307           Third  ...       No
1308           Third  ...       No

[1309 rows x 12 columns]

#Pandas Data Access

In [11]:
df.columns

Index(['Passenger Class', 'Name', 'Sex', 'Age',
       'No of Siblings or Spouses on Board',
       'No of Parents or Children on Board', 'Ticket Number', 'Passenger Fare',
       'Cabin', 'Port of Embarkation', 'Life Boat', 'Survived'],
      dtype='object')

In [12]:
df['Passenger Class']

0       First
1       First
2       First
3       First
4       First
        ...
1304    Third
1305    Third
1306    Third
1307    Third
1308    Third
Name: Passenger Class, Length: 1309, dtype: object

Access each element of data same as numpy

In [13]:
df.iloc[2,0:5]

Passenger Class                                              First
Name                                  Allison, Miss. Helen Loraine
Sex                                                         Female
Age                                                              2
No of Siblings or Spouses on Board                               1
Name: 2, dtype: object

Dataset can mix type

In [14]:
df.dtypes

Passenger Class                        object
Name                                   object
Sex                                    object
Age                                   float64
No of Siblings or Spouses on Board    float64
No of Parents or Children on Board    float64
Ticket Number                          object
Passenger Fare                        float64
Cabin                                  object
Port of Embarkation                    object
Life Boat                              object
Survived                               object
dtype: object

Find Min and Max

In [15]:
df['Age'].max()

80.0